cold_warm_start_AB/iperf3/NANO/ab_cws_iperf3_nano_logs_16.txt
Wed Jun 16 19:54:54 EDT 2021
***********************
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.20 (be patient)...INFO: GET header == 
---
GET /function/iperf3 HTTP/1.0
Host: 192.168.1.20:8080
User-Agent: ApacheBench/2.3
Accept: */*


---
LOG: header received:
HTTP/1.0 200 OK
Content-Length: 1290
Content-Type: text/plain; charset=utf-8
Date: Wed, 16 Jun 2021 23:55:13 GMT
X-Duration-Seconds: 10.605630

---------------------------------------------------------------------------------------------------------------------------

Server started in the background. Awaiting for packeges...

Packeges from the client has been sent to the server.

Here are the statistics of sender:
1. Data Transferred: 12.0 GBytes
2. Bitrate: 10.3 Gbits/sec
---------------------------------------------------------------------------------------------------------------------------

Here are the statistics of receiver:
1. Data Received: 12.0 GBytes
2. Bitrate: 10.3 Gbits/sec
---------------------------------------------------------------------------------------------------------------------------

Obtaining information to kill the server running in the background...

Information collection for 'iperf3 -s -D' complete. PId for this process is 24

Proess "iperf3 -s -D" has been successfully terminated.

---------------------------------------------------------------------------------------------------------------------------

iperf3 command executed in 10.04 seconds.

Function executed in 10.17 seconds.

---------------------------------------------------------------------------------------------------------------------------

Function to measure network per
LOG: header received:
HTTP/1.0 200 OK
Content-Length: 1290
Content-Type: text/plain; charset=utf-8
Date: Wed, 16 Jun 2021 23:55:24 GMT
X-Duration-Seconds: 10.442250

---------------------------------------------------------------------------------------------------------------------------

Server started in the background. Awaiting for packeges...

Packeges from the client has been sent to the server.

Here are the statistics of sender:
1. Data Transferred: 12.4 GBytes
2. Bitrate: 10.7 Gbits/sec
---------------------------------------------------------------------------------------------------------------------------

Here are the statistics of receiver:
1. Data Received: 12.4 GBytes
2. Bitrate: 10.7 Gbits/sec
---------------------------------------------------------------------------------------------------------------------------

Obtaining information to kill the server running in the background...

Information collection for 'iperf3 -s -D' complete. PId for this process is 56

Proess "iperf3 -s -D" has been successfully terminated.

---------------------------------------------------------------------------------------------------------------------------

iperf3 command executed in 10.02 seconds.

Function executed in 10.04 seconds.

---------------------------------------------------------------------------------------------------------------------------

Function to measure network performance has been executed successfully.


LOG: header received:
HTTP/1.0 200 OK
Content-Length: 1290
Content-Type: text/plain; charset=utf-8
Date: Wed, 16 Jun 2021 23:55:34 GMT
X-Duration-Seconds: 10.437836

---------------------------------------------------------------------------------------------------------------------------

Server started in the background. Awaiting for packeges...

Packeges from the client has been sent to the server.

Here are the statistics of sender:
1. Data Transferred: 12.7 GBytes
2. Bitrate: 10.9 Gbits/sec
---------------------------------------------------------------------------------------------------------------------------

Here are the statistics of receiver:
1. Data Received: 12.7 GBytes
2. Bitrate: 10.9 Gbits/sec
---------------------------------------------------------------------------------------------------------------------------

Obtaining information to kill the server running in the background...

Information collection for 'iperf3 -s -D' complete. PId for this process is 87

Proess "iperf3 -s -D" has been successfully terminated.

---------------------------------------------------------------------------------------------------------------------------

iperf3 command executed in 10.01 seconds.

Function executed in 10.03 seconds.

---------------------------------------------------------------------------------------------------------------------------

Function to measure network performance has been executed successfully.


LOG: header received:
HTTP/1.0 200 OK
Content-Length: 1291
Content-Type: text/plain; charset=utf-8
Date: Wed, 16 Jun 2021 23:55:44 GMT
X-Duration-Seconds: 10.438711

---------------------------------------------------------------------------------------------------------------------------

Server started in the background. Awaiting for packeges...

Packeges from the client has been sent to the server.

Here are the statistics of sender:
1. Data Transferred: 12.6 GBytes
2. Bitrate: 10.8 Gbits/sec
---------------------------------------------------------------------------------------------------------------------------

Here are the statistics of receiver:
1. Data Received: 12.6 GBytes
2. Bitrate: 10.8 Gbits/sec
---------------------------------------------------------------------------------------------------------------------------

Obtaining information to kill the server running in the background...

Information collection for 'iperf3 -s -D' complete. PId for this process is 125

Proess "iperf3 -s -D" has been successfully terminated.

---------------------------------------------------------------------------------------------------------------------------

iperf3 command executed in 10.03 seconds.

Function executed in 10.05 seconds.

---------------------------------------------------------------------------------------------------------------------------

Function to measure network performance has been executed successfully.


LOG: header received:
HTTP/1.0 200 OK
Content-Length: 1291
Content-Type: text/plain; charset=utf-8
Date: Wed, 16 Jun 2021 23:55:55 GMT
X-Duration-Seconds: 10.451567

---------------------------------------------------------------------------------------------------------------------------

Server started in the background. Awaiting for packeges...

Packeges from the client has been sent to the server.

Here are the statistics of sender:
1. Data Transferred: 12.4 GBytes
2. Bitrate: 10.6 Gbits/sec
---------------------------------------------------------------------------------------------------------------------------

Here are the statistics of receiver:
1. Data Received: 12.4 GBytes
2. Bitrate: 10.6 Gbits/sec
---------------------------------------------------------------------------------------------------------------------------

Obtaining information to kill the server running in the background...

Information collection for 'iperf3 -s -D' complete. PId for this process is 156

Proess "iperf3 -s -D" has been successfully terminated.

---------------------------------------------------------------------------------------------------------------------------

iperf3 command executed in 10.01 seconds.

Function executed in 10.03 seconds.

---------------------------------------------------------------------------------------------------------------------------

Function to measure network pe
..done


Server Software:        
Server Hostname:        192.168.1.20
Server Port:            8080

Document Path:          /function/iperf3
Document Length:        Variable

Concurrency Level:      1
Time taken for tests:   58.647 seconds
Complete requests:      5
Failed requests:        0
Total transferred:      7202 bytes
HTML transferred:       6452 bytes
Requests per second:    0.09 [#/sec] (mean)
Time per request:       11729.437 [ms] (mean)
Time per request:       11729.437 [ms] (mean, across all concurrent requests)
Transfer rate:          0.12 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    2   0.2      2       2
Processing: 10464 11728 2807.3  10480   16750
Waiting:    10461 11727 2807.6  10479   16749
Total:      10466 11729 2807.2  10481   16751

Percentage of the requests served within a certain time (ms)
  50%  10480
  66%  10482
  75%  10482
  80%  16751
  90%  16751
  95%  16751
  98%  16751
  99%  16751
 100%  16751 (longest request)
***********************